# PreScale Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Transform2D..::..PreScale Method
Transform2D Class See Also
---
Scales the linear part of this transformation and returns the result.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public Transform2D PreScale(
	double scale
)
```

Visual Basic
---
```text
Public Function PreScale ( _
	scale As Double _
) As Transform2D
```

Visual C++
---
```text
public:
Transform2D^ PreScale(
	double scale
)
```

# ### Parameters
scale
    Type: System..::..Double The scale value.
# ### Return Value
Returns a pointer to "this" Transform2D.
# Remarks
The resulting transformation is equivalent to the application of the uniform scale and then this transformation, in this order.
# See Also
Transform2D Class
Autodesk.Revit.DB Namespace